#ifndef __HARDWARE_H
#define __HARDWARE_H
/***********************************************************************************************************************************
 ** 【文件名称】  hardware.h
 ** 【淘    宝】  魔女开发板      https://demoboard.taobao.com
 ***********************************************************************************************************************************
 ** 【功能说明】  本头文件,用于统一存放用户头文件引用, 减少各文件引用h时的混乱;(建议:用户头文件由config.h管理, 标准库头文件由stm32f10x_conf.h管理
 **
 ** 【更新记录】  2020-04-25  创建
 **                
 **    
************************************************************************************************************************************/
#include <stm32f10x.h>  



/*****************************************************************************
 ** 设备头文件引用
****************************************************************************/
#include "system_f103.h"          // 系统常用功能, 如串口USART1配置115200-0-8-1, SysTic配置为1ms中断, 
#include "scheduler.h"            // 任务轮询   

#include "bsp_led.h"              // LED指示灯
#include "bsp_key.h"              // 按键
#include "bsp_w25qxx.h"           // 
#include "bsp_usart.h"            // USART1、2、3，UART4、5
#include "bsp_lcd_2.8_ili93xx.h"
#include "bsp_xpt2046.h"
#include "bsp_can.h"
#include "bsp_MQTT.h"




/*****************************************************************************
 ** 声明全局函数
****************************************************************************/
u8   Hardware_Init(void);
void Hardware_NVICManage (void);


#endif










